import numpy as np

# Перевірити, чи буде дане відношення рефлексивним, антирефлексивним,
# симетричним, антисиметричним, асиметричним, транзитивним. Відшукати
# для нього найбільший, найменший , максимальний та мінімальний елементи,
# якщо такі існують, і побудувати обернене й додаткове відношення

# [1, 1, 0, 1, 0]
# [1, 1, 1, 1, 0]
# [0, 0, 0, 0, 1]
# [1, 0, 1, 1, 1]
# [0, 1, 0, 0, 0]

r = np.array([[1, 1, 0, 1, 0],[1, 1, 1, 1, 0],[0, 0, 0, 0, 1],[1, 0, 1, 1, 1],[0, 1, 0, 0, 0]])
# print(r.shape)

# Відношення R називається рефлексивним, якщо
# x R x для будь-якого елемента x∈Ω .

# Відношення R називається антирефлексивним, коли
# твердження x R y означає, що x ≠ y ∀ ∈x Ω. 
# У матриці антирефлексивного відношення елементи головної діагоналі
# дорівнюють нулю, тобто aij = ,0 якщо i = j .

def check_refl(r):
    i = 0
    j = 0

    is_refl = False
    is_antirefl = False

    while i != r.shape[0] and j != r.shape[1]:
        if r[i, j] == 1:
            is_refl = True
        elif is_refl and r[i, j] == 0:
            is_refl = False
            break
        elif r[i, j] == 0:
            is_antirefl = True
        elif is_antirefl and r[i, j] == 1:
            is_antirefl = False
            break
        i += 1
        j += 1
    return ["Nor refl nor antirefl", ["Refl", "Antirefl"][is_antirefl]][is_refl or is_antirefl]

print(check_refl(r))


# Відношення R називається симетричним, якщо
# x R y ⇒ y R x

# Відношення R називається асиметричним, якщо
# R cross R^-1 = 0 (тобто з двох виразів x R y та y R x хоча б один не відповідає
# дійсності). 

# Відношення R називається антисиметричним,
# якщо твердження x R y та y R x можуть бути правильними одночасно тоді й
# тільки тоді, коли x = y. 

# Відношення R називається транзитивним, якщо
# R^2 <= R ( тобто, коли з тверджень x R z та z R y випливає, що x R y ). 

# Елемент * x множини Х будемо називати найкращим з огляду на
# відношення R, якщо x R x * справедливе для всякого елемента x∈ X .

# Елемент ∈ Xx* будемо називати найгіршим з огляду на відношення R,
# якщо * x R x для всіх елементів x∈ X . 

# Елемент max x називається максимальним за відношенням S R на множині
# Х, коли для абиякого елемента x∈ X має місце твердження xRx S
# max або
# елемент max x непорівнянний з x.
# Іншими словами, не існує елемента (альтернативи) x∈ X , який був би
# кращим за альтернативу max x .
# Множина максимальних з огляду на відношення R елементів множини Х
# позначається R X .max

# Елемент min x називається мінімальним відносно S R на множині Х, якщо
# для всіх x∈ X або min xx RS , або х непорівняний з min x . Отже, не існує елемента
# x ∈ X який був би гіршим за min x ; немає жодного елемента х, над яким би
# домінував елемент min x .
# Множина мінімальних з огляду на відношення R елементів множини Х
# позначається як min R X . 

# Оберненим до відношення R називається
# відношення −1 R , яке задовольняє таку умову:
#  xR yy x R- 1 ⇔ . (2.4)
# Для матриць відношень R та −1 R буде мати місце така формула:
# ij( )= ji( )

# Відношення R називається доповненням відношення
# R , тоді й тільки тоді, коли воно пов’язує тільки ті пари елементів, для яких не
# виконується відношення R .
# Очевидно, що
# Ω ,\ 2 R = R (2.3)
# тому в матричному записі ij( ) 1−= ij( ) RaRa , = ,1, nji . 